<script setup lang="ts">
import { defineEmits,ref,onMounted } from 'vue'

const emit = defineEmits(['showMobileMenu'])
const isElVisible = ref(false)
const isElVisibleItem = ref(false)
const isElVisibleItemMobile = ref(false)

const calcScreenSizeRules = ()  =>{
  let width = window.innerWidth;
  if (width < 1300) {
    // console.log('11111111 ШИРИНА ЭКРАНА < 1300 =', width)
    this.isElVisible = !this.isElVisible;

    if (width > 725 && width < 1300) {
      this.isElVisibleItem = !this.isElVisibleItem;
    } else if (width <= 725) {
      this.isElVisibleItemMobile = !this.isElVisibleItemMobile;
    }
  }
}
onMounted( () => {
  calcScreenSizeRules()
})
</script>


<template>
  <section class="rules">
    <div class="container">
      <h1 class="rules__title">Правила посещения</h1>

      <ol class="rules__list">
        <li class="rules__list-item">
          Под кинотеатром «JAZZ CINEMA» (далее – Кинотеатр) в настоящих «Правилах посещения кинотеатра «JAZZ CINEMA» (далее – Правила) понимается: помещение расположенное по адресу: Челябинская область г. Магнитогорск, ул. Герцена д.6, ТРК «Джаз Молл», 2 этаж.
        </li>

        <li class="rules__list-item">
          Настоящие Правила разработаны с целью обеспечения безопасности посетителей и работников Кинотеатра во время их нахождения на территории Кинотеатра, а также обеспечения сохранности имущества Кинотеатра, и обязательны для исполнения всеми лицами, находящимися на территории Кинотеатра. К территории Кинотеатра в соответствии с настоящими Правилами относятся: кинозалы, фойе Кинотеатра, территория бара (территорией бара являются барная стойка и часть фойе Кинотеатра, занятая столиками).
        </li>

        <li class="rules__list-item">
          Время начала и окончания работы Кинотеатра указано на информационной доске (стендах, стойках и т.п.), установленной в фойе Кинотеатра.
        </li>

        <li class="rules__list-item">
          Посетители и работники Кинотеатра обязаны быть взаимно вежливы, бережно относиться к имуществу Кинотеатра, соблюдать чистоту, общественный порядок и требования настоящих Правил.
        </li>

        <li class="rules__list-item" v-if="!isElVisibleItemMobile">
          Кинотеатр вправе:
          <ul class="rules__list-sublist">
            <li>
              самостоятельно устанавливать скидочные программы и программы лояльности, цены на билеты и цены на продукцию, продаваемую в баре (искл. сигареты);
            </li>

            <li>
              отменять установленные в Кинотеатре скидки на цены на билеты (по отдельным фильмам) при наличии специальных требований прокатных организаций;
            </li>

            <li>
              организовывать предварительную продажу билетов;
            </li>

            <li>
              разрешать вход в кинозал на очередной сеанс кинофильма не ранее чем за 10 минут до его начала;
            </li>

            <li>
              не допускать на территорию Кинотеатра в ночное время (с 23.00 до 6.00), а также на сеансы, время начала или окончания которых приходится на период с 23.00 до 6.00, лиц моложе 16 лет без сопровождения родителей (лиц их заменяющих). Под лицами, заменяющими родителей, понимаются: совершеннолетние близкие родственники (братья и сестры, дедушка, бабушка, братья и сестры родителей), усыновители, опекуны или попечители, представители учреждений, на попечении или под опекой которых находится несовершеннолетний в возрасте до шестнадцати лет;
            </li>

            <li>
              не продавать алкогольную продукцию и сигареты лицам моложе 18 лет.
            </li>

            <li>
              не допускать на сеансы кинофильмов (любые сеансы кинофильмов) детей до 6 лет без сопровождения родителей (лиц их заменяющих);
            </li>

            <li>
              заменить кинофильм в программе планируемого репертуара;
            </li>

            <li>
              организовывать предсеансовое обслуживание посетителей (в том числе организовывать выступление музыкальных ансамблей, артистов-исполнителей, проводить демонстрации киножурналов и др.);
            </li>

            <li>
              запрещать лицам, находящимся в фойе кинотеатра с иной целью, чем посещение киносеанса (например, посещение бара кинотеатра), пользоваться услугами гардероба кинотеатра.
            </li>
          </ul>
        </li>

        <li class="rules__list-item" v-if="!isElVisibleItem && !isElVisibleItemMobile">
          Посетители Кинотеатра имеют право:
          <ul class="rules__list-sublist">
            <li>
              на свободное пользование услугами кинообслуживания и услугами бара кинотеатра.
            </li>

            <li>
              на качественный кинопоказ;
            </li>

            <li>
              на получение полной и достоверной информации о Кинотеатре в отношении предоставляемых им видов услуг, в том числе дополнительных услуг;
            </li>

            <li>
              на возмещение стоимости билета (или частичное возмещение стоимости билета) в случае отмены сеанса кинофильма, замены кинофильма, при некачественной демонстрации кинофильма и в случае непредставления информации о возрастных ограничениях на просмотр кинофильма и отказа посетителя в этом случае от просмотра кинофильма.
            </li>

            <li>
              на свободное пользование услугами бара;
            </li>

            <li>
              на покупку качественной продукции бара;
            </li>

            <li>
              на получение полной и достоверной информации о продукции бара;
            </li>

            <li>
              на возмещение стоимости товара, в случае предоставления некачественной или просроченной продукции.
            </li>
          </ul>
        </li>

        <li class="rules__list-item" v-if="!isElVisibleItem && !isElVisibleItemMobile">
          Посетители при посещении Кинотеатра обязаны:
          <ul class="rules__list-sublist">
            <li>
              при входе в кинозалы Кинотеатра для просмотра кинофильма предъявлять билет сотруднику Кинозала (менеджеру по залам);
            </li>

            <li>
              сохранять билет до окончания сеанса кинофильма;
            </li>

            <li>
              в случае обнаружения задымлений или пожара, а также ситуаций, которые могут угрожать жизни и/или здоровью посетителей и сотрудников Кинотеатра, а также способных причинить вред имуществу Кинотеатра, немедленно сообщить об этом администратору Кинотеатра или любому другому сотруднику Кинотеатра, находящемуся поблизости;
            </li>

            <li>
              в случае обнаружения бесхозных вещей и предметов на территории Кинотеатра немедленно сообщить об этом администратору Кинотеатра или любому другому сотруднику Кинотеатра, находящемуся поблизости, и не предпринимать любых самостоятельных действий в отношении этих предметов;
            </li>

            <li>
              соблюдать указатели входа и выхода, установленные на территории Кинотеатра.
            </li>
          </ul>
        </li>

        <li class="rules__list-item" v-if="!isElVisibleItem && !isElVisibleItemMobile">
          Посетителям Кинотеатра запрещается:
          <ul class="rules__list-sublist">
            <li>
              заходить на территорию Кинотеатра со спиртными напитками и продуктами питания (за исключением продуктов питания и напитков, приобретенных в баре Кинотеатра);
            </li>

            <li>
              заходить в залы Кинотеатра с пищевыми продуктами без упаковки, в открытой упаковке (за исключением попкорна, мороженного в пластиковых стаканах, чипсов, приобретенных в баре Кинотеатра) и с напитками в стеклянной посуде;
            </li>

            <li>
              распивать принесенные с собой спиртные напитки в залах, фойе и баре Кинотеатра.
            </li>

            <li>
              входить на территорию Кинотеатра в нетрезвом состоянии или в состоянии наркотического или токсического опьянения. Администратор Кинотеатра вправе предложить такому посетителю обменять купленный билет на билет на другой сеанс кинофильма в другой день, когда посетитель не будет находиться в нетрезвом состоянии или в состоянии наркотического или токсического опьянения;
            </li>

            <li>
              курить на территории Кинотеатра.
            </li>

            <li>
              входить на территорию Кинотеатра с предметами и/или в одежде, которые могут повредить имущество посетителей Кинотеатра, сотрудников Кинотеатра, а так же имущество Кинотеатра. Такими предметами являются: грязная строительная униформа, одежда, испачканная производственным маслом, краской и т.п.
            </li>

            <li>
              проходить в зал Кинотеатра на сеанс кинофильма по билету, на котором указаны дата и время начала сеанса кинофильма, не соответствующие дате и времени начала сеанса, проходящего в тот момент в зале Кинотеатра;
            </li>

            <li>
              заходить на территорию Кинотеатра с багажом (сумками, чемоданами, сумками на колесиках и т.п.), любая сторона которого превышает 40 см.
            </li>

            <li>
              заходить на территорию Кинотеатра с предметами, которые могут травмировать посетителей и сотрудников Кинотеатра (линолеум, рубероид, металлическая сетка в рулонах, тяжелый металлический профиль, бытовая техника и т.п.);
            </li>

            <li>
              самовольно проникать в служебные, производственные и офисные помещения Кинотеатра, а также служебные, производственные и офисные помещения, прилегающие к территории Кинотеатра;
            </li>

            <li>
              наносить какие-либо надписи, рисунки, царапины и иные повреждения на имущество Кинотеатра (кресла, двери, стойка администратора, кассы, стены, барная стойка, холодильная витрина, столы, стулья, посуда и др.). Бросать любые предметы на пол Кинотеатра, в сторону экрана в кинозале и т.п.;
            </li>

            <li>
              бегать и сидеть на полу на территории Кинотеатра, ставить ноги на подголовники кресел в кинозалах и на столы в фойе;
            </li>

            <li>
              проносить на территорию Кинотеатра легковоспламеняющиеся, отравляющие, токсичные, ядовитые вещества, предметы и жидкости, бытовые газовые баллоны;
            </li>

            <li>
              пользоваться открытым огнем, пиротехническими устройствами (фейерверками, петардами и т.п.);
            </li>

            <li>
              проносить на территорию Кинотеатра любые виды оружия, колющие, режущие и легко бьющиеся предметы;
            </li>

            <li>
              проносить на территорию Кинотеатра лыжи, коньки, роликовые коньки, скейтборды и т.п. без чехлов или в ненадлежащей упаковке;
            </li>

            <li>
              осуществлять в кинозале фото-, кино-, видео- и аудиосъемку;
            </li>

            <li>
              заходить в кинозалы Кинотеатра раньше, чем за 10 минут до начала сеанса кинофильма, на который посетителем приобретен билет в кассе Кинотеатра;
            </li>

            <li>
              открывать двери в кинозал Кинотеатра во время сеанса кинофильма без определенной необходимости, а также препятствовать их закрытию или открытию сотрудником Кинотеатра;
            </li>

            <li>
              передвигаться по территории Кинотеатра на роликовых коньках, скейтбордах, велосипедах, самокатах и других аналогичных спортивных транспортных средствах;
            </li>

            <li>
              прослушивать в зале во время киносеанса аудиотехнику, в т.ч. разговаривать или прослушивать поступившие сообщения по мобильному телефону через громкоговоритель, использовать средства звукоусиления и играть на музыкальных инструментах;
            </li>

            <li>
              разговаривать по мобильному телефону, находясь в кинозале, во время демонстрации кинофильма;
            </li>

            <li>
              использовать территории Кинотеатра без письменного разрешения администрации Кинотеатра и заключения соответствующего договора для занятия коммерческой, рекламной и иной деятельностью, связанной с получением дохода;
            </li>

            <li>
              осуществлять любую агитационную деятельность на территории Кинотеатра;
            </li>

            <li>
              подключать электроприборы к электросети Кинотеатра без соответствующего разрешения администрации Кинотеатра;
            </li>

            <li>
              проходить на территорию Кинотеатра с животными.
            </li>
          </ul>
        </li>

        <li class="rules__list-item" v-if="!isElVisibleItem && !isElVisibleItemMobile">
          Ответственность за нарушение настоящих Правил:
          <ul class="rules__list-sublist">
            <li>
              в случае нарушения посетителем Кинотеатра общественного порядка и настоящих Правил администрация Кинотеатра вправе не допустить такого посетителя на просмотр кинофильма и/или вывести с территории Кинотеатра;
            </li>

            <li>
              за нарушение посетителем Кинотеатра настоящих Правил, повлекшее причинение ущерба имуществу Кинотеатра, посетитель несет имущественную ответственность в размере и в порядке, установленными действующим законодательством РФ.
            </li>
          </ul>
        </li>
      </ol>
    </div>

    <button class="rules_btn" v-if="isElVisible" @click="calcScreenSizeRules" type="button">Показать больше</button>
  </section>
</template>

<style lang="scss">
.rules {
  padding-top: 68px;

  @media (max-width: 1300px) {
    padding-top: 62px;
    //padding-bottom: 73px;
  }

  @media (max-width: 725px) {
    padding-top: 30px;
    padding-bottom: 40px;
    background: #fff;
    box-shadow: inset 0px 14px 14px -13px rgba(0,0,0,0.75);
  }

  & .container {
    @media (max-width: 725px) {
      flex-direction: column;
    }
  }

  &__title  {
    max-width: 170px;
    font-family: "NEXT ART";
    font-weight: 600;
    font-size: 20px;
    line-height: 22px;
    color: #FFFFFF;
    //text-transform: uppercase;

    @media (max-width: 1300px) {
      margin-top: 38px;
      //display: contents;

      font-size: 18px;
      line-height: 19.5px;
    }

    @media (max-width: 725px) {
      display: block;
      margin-top: 0;
      width: 100%;
      max-width: none;
      font-family: 'Montserrat';
      font-size: 16px;
      line-height: 19.5px;
      font-weight: 700;
      text-align: center;
      //text-transform:none!important;
      color: #01BDF9;
    }

    &::before {
      position: absolute;
      content: '';
      left: 0;
      top: 166px;

      width: 20%;
      height: 1px;

      background-color: #FFFFFF;

      @media (max-width: 1900px) {
        width: 23%;
      }

      @media (max-width: 1360px) {
        width: 26%;
      }

      @media (max-width: 1300px) {
        //width: 19%;
        width: 147px;
        top: 185px;
      }

      @media (max-width: 725px) {
        display: none;
      }
    }
  }

  &__list {
    width: 74.5%;
    padding-top: 20px;

    counter-reset: myCounter;

    font-family: 'Montserrat';
    font-size: 15px;
    line-height: 30px;
    color: #1C1C1C;

    @media (max-width: 1300px) {
      padding-top: 9px;
      //padding-left: 35px;
      padding-left: 62px;
    }

    @media (max-width: 725px) {
      padding: 19px 10px 0;
      width: 100%;
      font-size: 12px;
      line-height: 25px;
    }

    &-item {
      font-weight: 700;

      list-style: none;

      &:not(:last-child) {
        margin-bottom: 28px;
      }

      &::before {
        counter-increment: myCounter;
        content: counter(myCounter) ".";

        display: inline;

        font-family: 'Montserrat';
        font-weight: 800;
        font-size: 20px;
        line-height: 30px;
        color: #1C1C1C;

        @media (max-width: 725px) {
          font-size: 15px;
          line-height: 25px;
        }
      }
    }

    &-sublist {
      padding-left: 25px;

      font-weight: 500;

      list-style-type: disc;
    }
  }

  & .rules_btn {
    display: block;
    margin: 40px auto  0;
    padding-left: 27.2%;
    font-family: 'Montserrat';
    font-weight: 600;
    font-size: 15px;
    line-height: 18px;
    text-align: center;
    text-decoration: underline;
    background: inherit;
    color: #01BDF9;
    border: none;

    @media (max-width: 725px) {
      margin-top: 20px;
      padding-left: 0;
      font-weight: 500;
      font-size: 13px;
      line-height: 16px;
    }
  }
}
</style>
